; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v9)
             (pred_10 ?v6 ?v11)
             (pred_12 ?v4 ?v11)
             (pred_2 ?v12 ?v4 )
	     (pred_9 ?v4)
             (pred_4 ?v13)
             (pred_11 ?v6)
             (pred_8 ?v11)
             (pred_3 ?v4)
             (pred_7 ?v6)
             (pred_6 ?v4)
             (pred_1 ))



(:action op_2
:parameters (?v2 ?v3 ?v1 ?v7)
:precondition (and (pred_4 ?v2) (pred_4 ?v3) (pred_11 ?v1) (pred_8 ?v7)
          (pred_5 ?v2 ?v3) (pred_10 ?v1 ?v7)
                   (pred_12 ?v3 ?v7) (pred_9 ?v2) 
                   (pred_3 ?v3) (pred_7 ?v1))
:effect (and  (pred_6 ?v3) (not (pred_3 ?v3))))


(:action op_3
:parameters (?v2 ?v8)
:precondition (and (pred_4 ?v2) (pred_4 ?v8)
               (pred_9 ?v2) (pred_5 ?v2 ?v8) (pred_6 ?v8))
:effect (and (pred_9 ?v8) (not (pred_9 ?v2))))

(:action op_5
:parameters (?v2 ?v1)
:precondition (and (pred_4 ?v2) (pred_11 ?v1) 
                  (pred_9 ?v2) (pred_2 ?v1 ?v2) (pred_1 ))
:effect (and (pred_7 ?v1)
   (not (pred_2 ?v1 ?v2)) (not (pred_1 ))))


(:action op_1
:parameters (?v2 ?v10 ?v5)
:precondition (and (pred_4 ?v2) (pred_11 ?v10) (pred_11 ?v5)
                  (pred_9 ?v2) (pred_7 ?v5) (pred_2 ?v10 ?v2))
:effect (and (pred_7 ?v10) (pred_2 ?v5 ?v2)
        (not (pred_7 ?v5)) (not (pred_2 ?v10 ?v2))))

(:action op_4
:parameters (?v2 ?v1)
:precondition (and (pred_4 ?v2) (pred_11 ?v1) 
                  (pred_9 ?v2) (pred_7 ?v1))
:effect (and (pred_1 ) (pred_2 ?v1 ?v2) (not (pred_7 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_17 obj_14 obj_07 obj_22 obj_08 obj_16 obj_09 obj_05 obj_11 obj_13 obj_15 obj_02 obj_18 obj_06 obj_20
    obj_12 obj_01 obj_03
    obj_19 obj_04 obj_10
    )

    (:init
       (pred_1)

       (pred_4 obj_21)
       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_22)
       (pred_4 obj_08)
       (pred_4 obj_16)
       (pred_4 obj_09)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_11 obj_19)
       (pred_11 obj_04)
       (pred_11 obj_10)

       (pred_5 obj_21 obj_22)
       (pred_5 obj_21 obj_17)
       (pred_5 obj_17 obj_08)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_21)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_07 obj_09)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_22 obj_05)
       (pred_5 obj_22 obj_08)
       (pred_5 obj_22 obj_21)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_16)
       (pred_5 obj_08 obj_17)
       (pred_5 obj_08 obj_22)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_16 obj_09)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_16 obj_08)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_09 obj_07)
       (pred_5 obj_09 obj_16)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_22)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_13 obj_15)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_15 obj_13)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_18 obj_02)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_20 obj_06)
       (pred_3 obj_15)
       (pred_3 obj_06)
       (pred_3 obj_08)
       (pred_12  obj_15 obj_12)
       (pred_12  obj_06 obj_01)
       (pred_12  obj_08 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_6 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_22)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_18)
       (pred_6 obj_20)

       (pred_10  obj_19 obj_12)
       (pred_10  obj_04 obj_01)
       (pred_10  obj_10 obj_03)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_10 obj_02)
       (pred_9 obj_09)
    )

    (:goal (and
       (pred_2 obj_10 obj_16)
    ))
(:constraints
  (always (not (pred_9 obj_13)))
)
)

; plan
1. (op_3 obj_09 obj_07)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_07)
   goals met: 0 of 1
2. (op_3 obj_07 obj_14)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_14)
   goals met: 0 of 1
3. (op_3 obj_14 obj_17)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_17)
   goals met: 0 of 1
4. (op_3 obj_17 obj_21)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_21)
   goals met: 0 of 1
5. (op_3 obj_21 obj_22)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_22)
   goals met: 0 of 1
6. (op_3 obj_22 obj_05)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_05)
   goals met: 0 of 1
7. (op_3 obj_05 obj_02)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_02)
   goals met: 0 of 1
8. (op_5 obj_02 obj_10)
   deleted: (pred_2 obj_10 obj_02) (pred_1)
   added: (pred_7 obj_10)
   goals met: 0 of 1
9. (op_3 obj_02 obj_05)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_05)
   goals met: 0 of 1
10. (op_3 obj_05 obj_11)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_11)
   goals met: 0 of 1
11. (op_2 obj_11 obj_08 obj_10 obj_03)
   deleted: (pred_3 obj_08)
   added: (pred_6 obj_08)
   goals met: 0 of 1
12. (op_3 obj_11 obj_08)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_08)
   goals met: 0 of 1
13. (op_3 obj_08 obj_16)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_16)
   goals met: 0 of 1
14. (op_4 obj_16 obj_10)
   deleted: (pred_7 obj_10)
   added: (pred_1) (pred_2 obj_10 obj_16)
   goals met: 1 of 1
